import json


def get_prompt():
    example_json = {
        "Connections": [
            {
                "顧問": "",
                "表兄": "",
                "兄弟": "",
                "妹夫": "",
                "同學": "",
                "同事": "",
                "堂兄弟": "",
                "女兒": "",
                "後代": "",
                "父親": "",
                "岳父": "",
                "長女": "",
                "長子": "",
                "友人": "",
                "朋友關係": "",
                "祖父": "",
                "祖母": "",
                "孫": "",
                "曾子孫": "",
                "工作關係": "",
                "丈夫": "",
                "介紹人": "",
                "親屬關係": "",
                "認識": "",
                "母親": "",
                "外孫": "",
                "姪子": "",
                "姐姐": "",
                "參與政治": "",
                "同遊": "",
                "兒子": "",
                "女婿": "",
                "夫妻": "",
                "有幕僚": "",
                "學生": "",
                "有下屬": "",
                "贊助政治活動": "",
                "老師": "",
                "師生關係": "",
                "妻子": "",
                "為…工作": "",
                "雅集": "",
                "弟弟": "",
                "妹妹": "",
                "是...的顧問": "",
                "是....的表兄": "",
                "是...的妹夫": "",
                "是...的兄弟": "",
                "是...的同學": "",
                "是...的同事": "",
                "是...的堂兄弟": "",
                "是...的女兒": "",
                "是...的後代": "",
                "是...岳父": "",
                "是...的父親": "",
                "是...的長女": "",
                "是...的長子": "",
                "友人": "",
                "是...的朋友關係": "",
                "是...的祖父": "",
                "是...的祖母": "",
                "是...的孫": "",
                "是...的曾子孫": "",
                "是...的工作關係": "",
                "是...的丈夫": "",
                "是...的介紹人": "",
                "是...的親屬關係": "",
                "與...認識": "",
                "是...的外孫": "",
                "是...的母親": "",
                "是...的姪子": "",
                "是...的姐姐": "",
                "參與政治": "",
                "同遊": "",
                "是...的女婿": "",
                "是...的兒子": "",
                "是...的夫妻": "",
                "是...的幕僚": "",
                "是...的學生": "",
                "是...的下屬": "",
                "被...贊助政治活動": "",
                "是...的老師": "",
                "是...的師生關係": "",
                "是...的妻子": "",
                "有...為其工作": "",
                "雅集": "",
                "是...的弟弟": "",
                "是...的妹妹": "",
                "關係備註": "",
                "原始資料": ""
            },
        ]
    }

    system_message = """你是一位文學作家調查者和 json 格式大師。接下來會給你一段文章，並根據文章內容填入相關資訊，攸關於"人際關係(Connections)"。
    資料格式應該像是: """ + json.dumps(example_json) + """。請確實找到文章內容再填入，資料正確很重要，
    一步一步慢慢做，即使多欄位空白也沒關係"""

    rule = """
    請遵循以下規則:
    1.以繁體中文回答
    2."原始資料" 請放文章內的引用，要簡短，不可超過20字。
    3.找出文章描敘主角的人際關係，將有確實提到的 "人名" 填入就可以。
    4....的爸爸、...的媽媽 這種不算人名，請勿填入
    5.不一定每位作家都有描述到人際關係，沒有就不要填
    6.無提及的欄位請刪除
    7.科系、公司、組織並不算人物名稱，請勿填入，欄位內不能有非人名資料。
    8.全部都沒有的話輸出"{}"，讓我可以解析json格式
    """

    return [system_message, rule]
